zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxn/pinctrl/MCXN247VDF-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXN247VDF/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXN947VDF-pinctrl.h with this part's differences applied
 * below (105 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 5c1d4a3d156c0945
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXN247VDF_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXN247VDF_WRAPPER_

#include "MCXN947VDF-pinctrl.h"

/* Signals not present on this part */
#undef CMP2_IN0_PIO1_2
#undef CMP2_IN1_PIO0_7
#undef CMP2_IN2_PIO0_23
#undef CMP2_IN3_PIO1_21
#undef CMP2_IN4N_PIO4_2
#undef CMP2_IN4P_PIO4_23
#undef CMP2_IN5N_PIO4_3
#undef FC8_P0_PIO3_14
#undef FC8_P1_PIO3_15
#undef FC8_P2_PIO3_16
#undef FC8_P3_PIO3_17
#undef FC8_P4_PIO3_20
#undef FC8_P5_PIO3_21
#undef FC8_P6_PIO3_22
#undef FC9_P0_PIO2_4
#undef FC9_P1_PIO2_3
#undef FC9_P2_PIO2_5
#undef FC9_P3_PIO2_2
#undef FC9_P4_PIO2_6
#undef FC9_P5_PIO2_7
#undef FC9_P6_PIO2_0
#undef HSCMP2_OUT_PIO0_11
#undef HSCMP2_OUT_PIO0_6
#undef PDM0_CLK_PIO0_16
#undef PDM0_CLK_PIO0_4
#undef PDM0_DATA0_PIO0_17
#undef PDM0_DATA0_PIO0_5
#undef PDM0_DATA1_PIO0_18
#undef PDM0_DATA1_PIO0_6
#undef SAI0_MCLK_PIO1_30
#undef SAI0_MCLK_PIO3_7
#undef SAI0_RXD0_PIO2_3
#undef SAI0_RXD0_PIO3_11
#undef SAI0_RXD1_PIO1_5
#undef SAI0_RXD1_PIO2_4
#undef SAI0_RXD1_PIO3_12
#undef SAI0_RX_BCLK_PIO2_0
#undef SAI0_RX_BCLK_PIO3_14
#undef SAI0_RX_FS_PIO2_1
#undef SAI0_RX_FS_PIO3_15
#undef SAI0_TXD0_PIO2_2
#undef SAI0_TXD0_PIO3_10
#undef SAI0_TXD1_PIO1_4
#undef SAI0_TXD1_PIO2_5
#undef SAI0_TXD1_PIO3_13
#undef SAI0_TX_BCLK_PIO2_6
#undef SAI0_TX_BCLK_PIO3_8
#undef SAI0_TX_FS_PIO2_7
#undef SAI0_TX_FS_PIO3_9
#undef SAI1_MCLK_PIO1_21
#undef SAI1_MCLK_PIO3_6
#undef SAI1_RXD0_PIO1_3
#undef SAI1_RXD0_PIO2_9
#undef SAI1_RXD0_PIO3_21
#undef SAI1_RXD1_PIO2_10
#undef SAI1_RXD1_PIO3_22
#undef SAI1_RX_BCLK_PIO1_6
#undef SAI1_RX_BCLK_PIO3_18
#undef SAI1_RX_FS_PIO1_7
#undef SAI1_RX_FS_PIO3_19
#undef SAI1_TXD0_PIO1_2
#undef SAI1_TXD0_PIO2_8
#undef SAI1_TXD0_PIO3_20
#undef SAI1_TXD1_PIO2_11
#undef SAI1_TXD1_PIO3_23
#undef SAI1_TX_BCLK_PIO1_0
#undef SAI1_TX_BCLK_PIO3_16
#undef SAI1_TX_FS_PIO1_1
#undef SAI1_TX_FS_PIO3_17
#undef SDHC0_CLK_PIO2_4
#undef SDHC0_CMD_PIO2_5
#undef SDHC0_D0_PIO2_3
#undef SDHC0_D1_PIO2_2
#undef SDHC0_D2_PIO2_7
#undef SDHC0_D3_PIO2_6
#undef SDHC0_D4_PIO2_1
#undef SDHC0_D5_PIO2_0
#undef SDHC0_D6_PIO2_9
#undef SDHC0_D7_PIO2_8
#undef TSI0_CH0_PIO1_0
#undef TSI0_CH10_PIO0_6
#undef TSI0_CH11_PIO0_16
#undef TSI0_CH12_PIO0_17
#undef TSI0_CH13_PIO0_18
#undef TSI0_CH14_PIO0_19
#undef TSI0_CH15_PIO0_20
#undef TSI0_CH16_PIO0_21
#undef TSI0_CH17_PIO1_8
#undef TSI0_CH18_PIO1_9
#undef TSI0_CH19_PIO1_10
#undef TSI0_CH1_PIO1_1
#undef TSI0_CH20_PIO1_11
#undef TSI0_CH21_PIO1_12
#undef TSI0_CH22_PIO1_13
#undef TSI0_CH23_PIO1_14
#undef TSI0_CH24_PIO1_15
#undef TSI0_CH2_PIO1_2
#undef TSI0_CH3_PIO1_3
#undef TSI0_CH4_PIO1_4
#undef TSI0_CH5_PIO1_5
#undef TSI0_CH6_PIO1_6
#undef TSI0_CH7_PIO1_7
#undef TSI0_CH8_PIO0_4
#undef TSI0_CH9_PIO0_5
#undef USB0_VBUS_DET_PIO4_12

#endif /* _ZEPHYR_DTS_BINDING_MCXN247VDF_WRAPPER_ */
